# Let's learn Pandas

In [2]:
for i in range(11, 21): 
    print('i =', i)

i = 11
i = 12
i = 13
i = 14
i = 15
i = 16
i = 17
i = 18
i = 19
i = 20

In [5]:
import pandas as pd
from ex01 import dirr

In [8]:
# pd.read_table reads the content of a TSV file by default
df = pd.read_table('./resources/chipotle.tsv')
type(df)

pandas.core.frame.DataFrame

In [9]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [10]:
df.tail()

,order_id,quantity,item_name,choice_description,item_price
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
order_id              4622 non-null int64
quantity              4622 non-null int64
item_name             4622 non-null object
choice_description    3376 non-null object
item_price            4622 non-null object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [13]:
df.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [18]:
users = pd.read_table('./resources/u.user', sep='|', index_col='user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [19]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [20]:
df.shape

(4622, 5)

In [21]:
users.shape

(943, 4)

In [22]:
df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [25]:
# df.item_name
df['item_name']

0                Chips and Fresh Tomato Salsa
1                                        Izze
2                            Nantucket Nectar
3       Chips and Tomatillo-Green Chili Salsa
4                                Chicken Bowl
                        ...
4617                            Steak Burrito
4618                            Steak Burrito
4619                       Chicken Salad Bowl
4620                       Chicken Salad Bowl
4621                       Chicken Salad Bowl
Name: item_name, Length: 4622, dtype: object

In [29]:
cols = ['item_name', 'item_price']
df[cols]

                                  item_name item_price
0              Chips and Fresh Tomato Salsa     $2.39
1                                      Izze     $3.39
2                          Nantucket Nectar     $3.39
3     Chips and Tomatillo-Green Chili Salsa     $2.39
4                              Chicken Bowl    $16.98
...                                     ...        ...
4617                          Steak Burrito    $11.75
4618                          Steak Burrito    $11.75
4619                     Chicken Salad Bowl    $11.25
4620                     Chicken Salad Bowl     $8.75
4621                     Chicken Salad Bowl     $8.75

[4622 rows x 2 columns]

In [32]:
users.occupation.unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [33]:
users.occupation.nunique()

21

In [35]:
users.gender.value_counts()

M    670
F    273
Name: gender, dtype: int64

In [41]:
users[users.gender=='F']

         age gender  occupation zip_code
user_id
2         53      F       other    94043
5         33      F       other    15213
11        39      F       other    30329
12        28      F       other    06405
15        49      F    educator    97301
...      ...    ...         ...      ...
925       18      F    salesman    49036
930       28      F   scientist    07310
938       38      F  technician    55038
939       26      F     student    33319
942       48      F   librarian    78209

[273 rows x 4 columns]

In [44]:
df[df.quantity > 5]

,order_id,quantity,item_name,choice_description,item_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,$44.25
3599,1443,7,Bottled Water,NaN,$10.50
3887,1559,8,Side of Chips,NaN,$13.52
4152,1660,10,Bottled Water,NaN,$15.00

In [59]:
users[ (users.occupation=='writer') & (users.gender=='F') ]

         age gender occupation zip_code
user_id
122       32      F     writer    22206
236       44      F     writer    53214
264       36      F     writer    90064
389       44      F     writer    83702
390       42      F     writer    85016
491       43      F     writer    53711
503       50      F     writer    27514
504       40      F     writer    92115
507       18      F     writer    28450
518       49      F     writer    99709
557       30      F     writer    11217
558       56      F     writer    63132
617       27      F     writer    11201
620       18      F     writer    81648
668       29      F     writer    10016
736       48      F     writer    94618
796       32      F     writer    33755
798       40      F     writer    64131
911       37      F     writer    53210

In [60]:
drinks_data = pd.read_csv('./resources/drinks.csv')

In [65]:
type(drinks_data.country)

pandas.core.series.Series

In [69]:
drinks_data.country.sort_values(ascending=False)

192       Zimbabwe
191         Zambia
190          Yemen
189        Vietnam
188      Venezuela
          ...
4           Angola
3          Andorra
2          Algeria
1          Albania
0      Afghanistan
Name: country, Length: 193, dtype: object